---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.BeamSystemFailures
source: html/cafb690f-b20c-c05f-3d4b-27ba603c2f66.htm
---
# BuiltInFailures.BeamSystemFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.